BackEnd/rails/27/library_managment/app/controllers/books_controller.rb

SELECT  "books".* FROM "books" WHERE "books"."id" = $1 LIMIT 1  [["id", 12]]
---
   def edit
   	# binding.pry
  	@book=Book.find_by_id(params[:id])

SELECT "books".* FROM "books"
---
  def index
  	# binding.pry
  	@books=Book.all

INSERT INTO "books" ("book_name", "author", "publication", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["book_name", "hdhfj"], ["author", "hjh"], ["publication", "jhh"], ["created_at", "2016-10-26 09:58:56.702192"], ["updated_at", "2016-10-26 09:58:56.702192"]]
---
  def create
  	# binding.pry
  	@book=Book.new(book_params)
  	# binding.pry
  	@book.save